src/cf/Catalogs/уатСерииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатСерииНоменклатуры</Name>
			<Comment>Агрегаты (уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипАгрегата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Comment>Модель агрегата</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМоделиАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервоначальнаяСтоимость</Name>
					<Comment>Первоначальная стоимость агрегата</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта первоначальной стоимости</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоЭксплуатации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоденДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроизводстваШины</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокСлужбыШины</Name>
					<Comment>Срок службы, мес.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/уатВариантыНачисленияИзносаАгрегатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВариантыНачисленияИзносаАгрегатов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Период</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНачислять</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/уатМоделиАгрегатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатМоделиАгрегатов</Name>
			<Comment>(уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипАгрегата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШинаШирина</Name>
					<Comment>Ширина шины</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатШиныШирина</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШинаВысота</Name>
					<Comment>Высота шины</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатШиныВысота</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШинаДиаметр</Name>
					<Comment>Диаметр шины</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатШиныРадиус</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШинаИндексНагрузки</Name>
					<Comment>Индекс нагрузки шины</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатШиныПрофиль</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШинаИндексСкорости</Name>
					<Comment>Индекс скорости шины</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатШиныИндексыСкорости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШинаСезонность</Name>
					<Comment>Сезонность шины</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатСезонностьШин</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШинаТипКонструкции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатТипыКонструкцииШин</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШинаДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаПробега</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаЗатрат</Name>
					<Comment>Норма затрат, % от стоимости на количество единиц выработки.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Емкость</Name>
					<Comment>Емкость</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатЕмкостьАккумуляторов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокСлужбы</Name>
					<Comment>Срок службы агрегата, месяцев</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНачисленияИзноса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВариантыНачисленияИзносаАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрВыработкиНачисленияИзноса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИзмерениеИзносаВЧасах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/уатСерииНоменклатуры/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ПеременныеФормы

&НаКлиенте
Перем НеобходимоЗаписать;

#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатСправочникФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если Объект.Ссылка.Пустая() Тогда
		Элементы.ОткрытьОтчетПробегИзносШин.Видимость = Ложь;
		Если Объект.ТипАгрегата = ПредопределенноеЗначение("Справочник.уатТипыАгрегатов.Шина") Тогда
			Объект.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
		КонецЕсли;
	КонецЕсли;
	
	Если (Объект.ТипАгрегата = ПредопределенноеЗначение("Справочник.уатТипыАгрегатов.Шина")) 
		И (Не Объект.Ссылка.Пустая()) Тогда
		ОбщийПробег = ПолучитьПробегШины(Объект.Ссылка);
	КонецЕСли;
	
	Если Объект.ДатаПроизводстваШины <> Дата(1,1,1) Тогда
		ДатаПроизводстваШиныСтрока = Формат(НеделяГода(Объект.ДатаПроизводстваШины), "ЧЦ=2; ЧВН=") + Формат(Объект.ДатаПроизводстваШины, "ДФ=yy");
	КонецЕсли;
		
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
		Элементы.ГруппаПоследнийОсмотр.Видимость = Ложь;
		Элементы.ГруппаУчетВыработки.Видимость = Ложь;
	КонецЕсли;

	НаименованиеПоШаблону = СформироватьНаименованиеСервер();
    ВывестиПараметрВыработкиИзноса();
	
	уатОбщегоНазначения.ОтобразитьСтепеньИзносаИАктВАгрегатеТС(
		Объект.Ссылка, СтепеньИзноса, РасчетнаяСтепеньИзноса, ТекущийИзнос, ПоследнийАктПриемаПередачи);
	Если ЗначениеЗаполнено(ПоследнийАктПриемаПередачи) Тогда
		Элементы.ОткрытьДокументПоследнегоОсмотра.Заголовок = ПоследнийАктПриемаПередачи;
		Элементы.ДекорацияАктОтсутствует.Видимость = Ложь;
	Иначе
		Элементы.ОткрытьДокументПоследнегоОсмотра.Видимость = Ложь;
		Элементы.ДекорацияАктОтсутствует.Видимость = Истина;
	КонецЕсли;
	
	Элементы.ТекущийИзнос.Заголовок = "Износ, " + Объект.Валюта;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	уатЗащищенныеФункцииКлиент.уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	УстановитьВидимостьИДоступностьЭлементовФормы();
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = СформироватьНаименованиеСервер();
	КонецЕсли;
	
	Если НеобходимоЗаписать = Неопределено
		И ЗначениеЗаполнено(Объект.СерийныйНомер) Тогда
		
		РезЗапроса = ПроверкаУникальностиСерийногоНомера();
		Если РезЗапроса.Количество() > 0 тогда
			ТекстНСТР = НСтр("en='In the system there are already car parts with the specified serial number (%1). Continue?';ru='В системе уже имеются агрегаты с указанным серийным номером (%1). Продолжить?'");
			ТекстСообщения = СтрШаблон(ТекстНСТР, Объект.СерийныйНомер);
			Для Каждого ТекАгрегат Из РезЗапроса Цикл
				ТекстСообщения = ТекстСообщения + Символы.ПС + " " + ТекАгрегат;
			КонецЦикла;
			Отказ = Истина;
			Оповещ = Новый ОписаниеОповещения("ПередЗаписьюПроверкаУникальностиСерийногоНомераВопрос", ЭтотОбъект);
			ПоказатьВопрос(Оповещ, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ПередЗаписьюКонтрольНаименованияПоШаблону(Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюПроверкаУникальностиСерийногоНомераВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да тогда
		НеобходимоЗаписать = Истина;
		Отказ = Истина;
		ПередЗаписьюКонтрольНаименованияПоШаблону(Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюКонтрольНаименованияПоШаблону(Отказ)
	
	// условие того, что наименование ранее при записи элемента заполнялось по шаблону
	СтароеНаименование = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.Ссылка, "Наименование");
	Если ЗначениеЗаполнено(СтароеНаименование)
		И СтароеНаименование = НаименованиеПоШаблону
		И НЕ флОтключитьКонтрольНаименованияПоШаблону Тогда
		
		НовоеНаименованиеПоШаблону = СформироватьНаименованиеСервер();
		Если ЗначениеЗаполнено(НовоеНаименованиеПоШаблону) И Объект.Наименование <> НовоеНаименованиеПоШаблону Тогда
			Отказ = Истина;
			ДопПараметры = Новый Структура("НовоеНаименованиеПоШаблону, Отказ", НовоеНаименованиеПоШаблону, Отказ);
			Оповещ = Новый ОписаниеОповещения("ПередЗаписьюКонтрольНаименованияПоШаблонуВопрос", ЭтотОбъект, ДопПараметры);
			ПоказатьВопрос(Оповещ, "Измененить наименование на новое по шаблону?", РежимДиалогаВопрос.ДаНетОтмена);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если Отказ Тогда
		ЗаписатьИЗакрытьЗавершение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюКонтрольНаименованияПоШаблонуВопрос(Результат, ДопПараметры) Экспорт
	
	флОтключитьКонтрольНаименованияПоШаблону = Ложь;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Наименование = ДопПараметры.НовоеНаименованиеПоШаблону;
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		флОтключитьКонтрольНаименованияПоШаблону = Истина;
	Иначе
		флЗакрыватьПриЗаписи = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ДопПараметры.Отказ Тогда
		ЗаписатьИЗакрытьЗавершение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрытьЗавершение()
	
	Если Записать() И флЗакрыватьПриЗаписи И Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьВидимостьИДоступностьЭлементовФормы();
	ПослеЗаписиЗавершение();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписиЗавершение()
	
	Если флЗакрыватьПриЗаписи И Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	флЗакрыватьПриЗаписи = Истина;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипАгрегатаПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступностьЭлементовФормы();
	ПриИзмененииТипаАгрегатаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура МодельПриИзменении(Элемент)
	
	ПриИзмененииМоделиНаСервере();
	УстановитьВидимостьИДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

&НаКлиенте
Процедура ДатаПроизводстваШиныСтрокаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДатаПроизводства = ?(ЗначениеЗаполнено(Объект.ДатаПроизводстваШины), Объект.ДатаПроизводстваШины, ТекущаяДата());
	Подсказка  = НСтр("en='The production date of the tire:';ru='Дата производства шины:'");
	ЧастьДаты  = ЧастиДаты.Дата;
	Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораДатаПроизводстваШины", ЭтотОбъект);
	ПоказатьВводДаты(Оповещение, ДатаПроизводства, Подсказка, ЧастьДаты);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПроизводстваШиныСтрокаПриИзменении(Элемент)
	ГодПроизводства    = СокрЛП(Прав(ДатаПроизводстваШиныСтрока, 2));
	НеделяПроизводства = СокрЛП(Лев(ДатаПроизводстваШиныСтрока, 2));
	
	
	Если ((НЕ ЗначениеЗаполнено(ГодПроизводства) ИЛИ ГодПроизводства = "0")
		И (НЕ ЗначениеЗаполнено(НеделяПроизводства) ИЛИ НеделяПроизводства = "0" ИЛИ НеделяПроизводства = "00")) Тогда
		Объект.ДатаПроизводстваШины = Дата(1,1,1);
		ДатаПроизводстваШиныСтрока  = "";
		Модифицированность = Истина;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГодПроизводства) Тогда
		ГодПроизводства = Число(ГодПроизводства);
		ТекДата         = Число(Формат(ТекущаяДата(), "ДФ=yy"));
		ТекДатаГод      = Число(Лев(Формат(ТекущаяДата(), "ДФ=yyyy"), 2));
		ГодПроизводстваСтрока = Формат(ГодПроизводства, "ЧЦ=2; ЧВН=");
		Если НЕ ЗначениеЗаполнено(ГодПроизводстваСтрока) Тогда
			ГодПроизводстваСтрока = "00";
		КонецЕсли;
		Если ГодПроизводства < ТекДата + 10 Тогда
			ГодПроизводства = Строка(ТекДатаГод) + ГодПроизводстваСтрока;
			Иначе
			ГодПроизводства = Строка(ТекДатаГод -1) + ГодПроизводстваСтрока;
		КонецЕсли;
		ГодПроизводства = Число(ГодПроизводства);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НеделяПроизводства) 
		И НеделяПроизводства <> "0" И НеделяПроизводства <> "00" Тогда
		НеделяПроизводства = Число(НеделяПроизводства);
		мГод = ГодПроизводства;
		Если Не ЗначениеЗаполнено(ГодПроизводства) Тогда 
			мГод = Год(ТекущаяДата());
		КонецЕсли;
		Если НеделяПроизводства > НеделяГода(КонецГода(Дата(мГод,1,1))) Тогда
			НеделяПроизводства = НеделяГода(КонецГода(Дата(мГод,1,1)));
		КонецЕсли;
	Иначе
		НеделяПроизводства = 1;
	КонецЕсли;
	
	НеделяПроизводстваСтрока = Формат(НеделяПроизводства, "ЧЦ=2; ЧВН=");
	Объект.ДатаПроизводстваШины = ДатаПоНомеруНедели(НеделяПроизводства, ГодПроизводства);
	ДатаПроизводстваШиныСтрока  = НеделяПроизводстваСтрока + Формат(Объект.ДатаПроизводстваШины, "ДФ=yy");
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СерийныйНомерПриИзменении(Элемент)
	
	// сброс флага, чтобы при записи был выполнен контроль дублей серийного номера
	НеобходимоЗаписать = Неопределено;

КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	Элементы.ТекущийИзнос.Заголовок = "Износ, " + Объект.Валюта;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура НастроитьШаблон(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ОбъектНастройки", "Справочник_уатСерииНоменклатуры");
	ПараметрыФормы.Вставить("ТипАгрегата",     Объект.ТипАгрегата);
	
	ОткрытьФорму("ОбщаяФорма.уатНастройкаШаблона", ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименование(Команда)
	
	Объект.Наименование   = СформироватьНаименованиеСервер();
	НаименованиеПоШаблону = Объект.Наименование;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетИзносШинИАгрегатов(Команда)
	
	ПараметрыОткрытия = ПолучитьПараметрыОткрытияОтчета("уатИзносШинИАгрегатов", "ОсновнаяСхемаКомпоновкиДанных",,Объект.Ссылка);
	ОткрытьФорму("Отчет.уатИзносШинИАгрегатов.Форма", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура Объект_ЗаписатьИЗакрыть(Команда)
	
	флЗакрыватьПриЗаписи = Истина;
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура Объект_Записать(Команда)
	
	флЗакрыватьПриЗаписи = Ложь;
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокументПоследнегоОсмотра(Команда)
	
	ПоказатьЗначение(Неопределено, ПоследнийАктПриемаПередачи);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьПараметрыОткрытияОтчета(Отчет, Схема, ТС = Неопределено, мОбъект = Неопределено, КлючВарианта = Неопределено)
	
	Заказ        = Неопределено;
	Номенклатура = Неопределено;
	Если ТипЗнч(мОбъект) = Тип("Структура") Тогда
		Заказ        = мОбъект.Заказ;
		Номенклатура = мОбъект.Номенклатура;
	КонецЕсли;
	СхемаКомпоновкиДанных = Отчеты[Отчет].ПолучитьМакет(Схема);

	КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	НастройкиКомпоновки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	Для Каждого ТекЭлем Из НастройкиКомпоновки.Отбор.Элементы Цикл
		Если ЗначениеЗаполнено(ТС) И (Строка(ТекЭлем.ЛевоеЗначение) = "ТС" ИЛИ Строка(ТекЭлем.ЛевоеЗначение) = "ТСТекущее") Тогда
			ТекЭлем.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ТекЭлем.ПравоеЗначение = ТС;
			ТекЭлем.Использование = Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТС) И Строка(ТекЭлем.ЛевоеЗначение) = "ТСВыбыло" Тогда
			ТекЭлем.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ТекЭлем.ПравоеЗначение = ЗначениеЗаполнено(ТС.ДатаВыбытия);
			ТекЭлем.Использование = Истина;
		КонецЕсли;
		Если ТипЗнч(мОбъект) <> Тип("Структура") Тогда
			Если ЗначениеЗаполнено(мОбъект) И (Строка(ТекЭлем.ЛевоеЗначение) = "Шина" 
				ИЛИ Строка(ТекЭлем.ЛевоеЗначение) = "СерияНоменклатуры"
				ИЛИ Строка(ТекЭлем.ЛевоеЗначение) = "Агрегат"
				ИЛИ Строка(ТекЭлем.ЛевоеЗначение) = "ВидТО"
				ИЛИ Строка(ТекЭлем.ЛевоеЗначение) = "ЗаявкаНаРемонт"
				ИЛИ Строка(ТекЭлем.ЛевоеЗначение) = "Номенклатура"
				ИЛИ Строка(ТекЭлем.ЛевоеЗначение) = "ВидОбслуживания") Тогда
				ТекЭлем.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
				ТекЭлем.ПравоеЗначение = мОбъект;
				ТекЭлем.Использование  = Истина;
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(Заказ) И (Строка(ТекЭлем.ЛевоеЗначение) = "ЗаявкаНаРемонт") Тогда
				ТекЭлем.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
				ТекЭлем.ПравоеЗначение = Заказ;
				ТекЭлем.Использование  = Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Номенклатура) И (Строка(ТекЭлем.ЛевоеЗначение) = "Номенклатура") Тогда
				ТекЭлем.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
				ТекЭлем.ПравоеЗначение = Номенклатура;
				ТекЭлем.Использование  = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекЭлем Из НастройкиКомпоновки.ПараметрыДанных.Элементы Цикл
		Если ЗначениеЗаполнено(ТС) И Строка(ТекЭлем.Параметр) = "ОтображатьВыбывшиеТС" Тогда
			ТекЭлем.Значение     = ЗначениеЗаполнено(ТС.ДатаВыбытия);
			ТекЭлем.Использование = Истина;
		КонецЕсли;
		Если Строка(ТекЭлем.Параметр) = "ПериодОтчета" Тогда
			СтандартныйПериод = Новый СтандартныйПериод;
			СтандартныйПериод.ДатаНачала = Дата(1,1,1);
			СтандартныйПериод.ДатаОкончания = КонецДня(ТекущаяДата());
			ТекЭлем.Значение     = СтандартныйПериод;
		КонецЕсли;
	КонецЦикла;
	
	КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(НастройкиКомпоновки);

	сткПараметры = Новый Структура("СформироватьПриОткрытии, ПользовательскиеНастройки", Истина, КомпоновщикНастроекКомпоновкиДанных.ПользовательскиеНастройки);
	
	Если ЗначениеЗаполнено(КлючВарианта) Тогда
		сткПараметры.Вставить("КлючВарианта", КлючВарианта);
	КонецЕсли;
	Возврат сткПараметры;
КонецФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервереБезКонтекста
Функция ПолучитьПробегШины(Ссылка)
	Возврат Справочники.уатСерииНоменклатуры.ПолучитьПробегШины(Ссылка);
КонецФункции

&НаСервере
Функция ПроверкаУникальностиСерийногоНомера()
	Результат = Новый Массив;
	СпрОб = РеквизитФормыВЗначение("Объект");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатСерииНоменклатуры.Наименование
	|ИЗ
	|	Справочник.уатСерииНоменклатуры КАК уатСерииНоменклатуры
	|ГДЕ
	|	уатСерииНоменклатуры.СерийныйНомер = &СерийныйНомер
	|	И уатСерииНоменклатуры.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("СерийныйНомер", СпрОб.СерийныйНомер);
	Запрос.УстановитьПараметр("Ссылка", СпрОб.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Результат.Добавить(Выборка.Наименование);
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ПриИзмененииТипаАгрегатаНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Модель) И Объект.Модель.ТипАгрегата <> Объект.ТипАгрегата Тогда
		Объект.Модель = ПредопределенноеЗначение("Справочник.уатМоделиАгрегатов.ПустаяСсылка");
	КонецЕсли;
	
	Если Объект.ТипАгрегата = ПредопределенноеЗначение("Справочник.уатТипыАгрегатов.Шина") Тогда
		Объект.ГоденДо              = 0;
		Объект.НачалоЭксплуатации   = 0;
	Иначе
		Объект.ДатаПроизводстваШины = 0;
		Объект.СрокСлужбыШины       = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииМоделиНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Модель) Тогда
		Объект.ТипАгрегата       = Объект.Модель.ТипАгрегата;
		Объект.ПараметрВыработки = Объект.Модель.ПараметрВыработки;
		Если Объект.ТипАгрегата = ПредопределенноеЗначение("Справочник.уатТипыАгрегатов.Шина") Тогда
			Объект.СрокСлужбыШины = Объект.Модель.СрокСлужбы;
		КонецЕсли;
	КонецЕсли;
	ВывестиПараметрВыработкиИзноса();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораДатаПроизводстваШины(Дата, ДополнительныеПараметры) Экспорт
	
	Если НЕ Дата = Неопределено Тогда
		ГодПроизводства    = Формат(Дата, "ДФ=yy");
		НеделяПроизводства = НеделяГода(Дата);
		Объект.ДатаПроизводстваШины = Дата;
		НеделяПроизводства = Формат(НеделяПроизводства, "ЧЦ=2; ЧВН=");
		ДатаПроизводстваШиныСтрока = НеделяПроизводства + ГодПроизводства;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ДатаПоНомеруНедели(НомерНедели, Год = "")
	
	Если НомерНедели = 1 Тогда
		Возврат Дата(?(Год = "", Год(ТекущаяДата()), Год),1,1)+(НомерНедели-НеделяГода(Дата(?(Год = "", Год(ТекущаяДата()), Год), 1, 1))) * 604800;
	Иначе
		Возврат НачалоНедели(Дата(?(Год = "", Год(ТекущаяДата()), Год),1,1)+(НомерНедели-НеделяГода(Дата(?(Год = "", Год(ТекущаяДата()), Год), 1, 1)))* 604800);
	КонецЕсли;
	
КонецФункции 

&НаСервере
Функция СформироватьНаименованиеСервер()
	
	СпрОб = РеквизитФормыВЗначение("Объект");
	Возврат уатНастройкиШаблонов.СформироватьНаименованиеПоШаблону("Справочник_уатСерииНоменклатуры", СпрОб);
	
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьИДоступностьЭлементовФормы()
	
	Если Объект.ТипАгрегата = ПредопределенноеЗначение("Справочник.уатТипыАгрегатов.Шина") Тогда
		Элементы.ГруппаЭксплуатацияШин.Видимость = Истина;
		Элементы.ГруппаЭксплуатация.Видимость = Ложь;
	Иначе
		Элементы.ГруппаЭксплуатацияШин.Видимость = Ложь;
		Элементы.ГруппаЭксплуатация.Видимость = Истина;
	КонецЕсли;
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
		Элементы.СтепеньИзноса.Видимость = Ложь;
		Элементы.ДекорацияСтепеньИзноса.Видимость = Ложь;
		Элементы.ДекорацияРасчетнаяСтепеньИзноса.Ширина = 0;
	КонецЕсли;
		
	Модель_ВариантНачисленияИзноса = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.Модель, "ВариантНачисленияИзноса");
	Элементы.ГруппаВыработкаИИзнос.Видимость =
		(Модель_ВариантНачисленияИзноса = ПредопределенноеЗначение("Перечисление.уатВариантыНачисленияИзносаАгрегатов.Выработка")
		ИЛИ Модель_ВариантНачисленияИзноса = ПредопределенноеЗначение("Перечисление.уатВариантыНачисленияИзносаАгрегатов.Период"));
	Элементы.ГруппаОбщийПробег.Видимость = Модель_ВариантНачисленияИзноса
		= ПредопределенноеЗначение("Перечисление.уатВариантыНачисленияИзносаАгрегатов.Выработка");
		
КонецПроцедуры

&НаСервере
Процедура ВывестиПараметрВыработкиИзноса()
	
	Если ЗначениеЗаполнено(Объект.Модель.ПараметрВыработкиНачисленияИзноса) Тогда
		Элементы.ОбщийПробег.Заголовок = "" + Объект.Модель.ПараметрВыработкиНачисленияИзноса;
		Если ЗначениеЗаполнено(Объект.Модель.ПараметрВыработкиНачисленияИзноса.ЕдиницаИзмерения) Тогда
			Элементы.ОбщийПробег.Заголовок = Элементы.ОбщийПробег.Заголовок + ", " + Объект.Модель.ПараметрВыработкиНачисленияИзноса.ЕдиницаИзмерения;
		КонецЕсли;
	Иначе
		Элементы.ОбщийПробег.Заголовок = "Выработка";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
